[{"description":"Create a futuristic hero section with animated glass morphism design. Include a large headline 'Voice AI Agents Built for Enterprise', subheading about intelligent voice solutions, and a CTA button. Add animated background particles and gradient overlay. Dark theme with glass-effect cards.","type":"feature","passes":true,"id":1},{"description":"Build an innovative 'Industry Solutions' section showcasing 6 sectors: Healthcare, Logistics, Finance, Education, IT, and Telecommunication. Use glass morphism cards with hover animations. Each card shows the industry icon, name, and a brief benefit description with smooth transitions.","type":"feature","passes":true,"id":2},{"description":"Create an 'Agent Types' section showing Inbound Agents (incoming customer calls) and Outbound Agents (proactive outreach) with visual comparison. Use split-screen glass morphism design with animated icons and feature lists.","type":"feature","passes":true,"id":3},{"description":"Design an interactive 'Live Agent Demo' section with demo tabs for different industries. Include a mock conversation interface with animated message bubbles, showing real-time agent interactions. Add play buttons for video demos and interactive conversation simulator.","type":"feature","passes":true,"id":4},{"description":"Build a 'Capabilities' section with 8-10 unique features of Asklena voice agents: Natural Language Processing, Real-time Analytics, Multi-language Support, Seamless Integration, 24/7 Availability, Custom Training, Security & Compliance, Scalability. Use glass cards with icons and animated counters.","type":"feature","passes":true,"id":5},{"description":"Create a 'Why Choose Asklena' section with 4-5 key differentiators: Advanced AI Technology, Industry Expertise, Proven Results, Dedicated Support. Use glass morphism timeline or comparison layout with smooth animations.","type":"feature","passes":true,"id":6},{"description":"Design an interactive 'Use Cases' carousel showing real-world scenarios: Customer Support Automation, Appointment Scheduling, Lead Qualification, Payment Collection, Survey & Feedback. Use glass cards with smooth scroll and click navigation.","type":"feature","passes":true,"id":7},{"description":"Build a 'Get Started' section with a call-to-action form or quick contact buttons. Include sections for Enterprise Solution, API Documentation, and Schedule a Demo with glass morphism design and smooth interactions.","type":"feature","passes":true,"id":8},{"description":"Create a professional footer with company info, links (About, Features, Pricing, Documentation), social media icons, and contact information. Use glass effect with dark background.","type":"feature","passes":true,"id":9},{"description":"Add custom animations and transitions throughout: smooth glass morphism hover effects, gradient animations, particle effects, animated counters, staggered content reveals, and smooth scroll animations. Ensure dark theme consistency with purple/blue gradients and transparent glass elements.","type":"feature","passes":true,"id":10}]