[{"description":"Create a futuristic hero section with animated glass morphism design. Include a large headline 'Voice AI Agents Built for Enterprise', subheading about intelligent voice solutions, and a CTA button. Add animated background particles and gradient overlay. Dark theme with glass-effect cards.","type":"feature","passes":true,"id":1},{"description":"Build an innovative 'Industry Solutions' section showcasing 6 sectors: Healthcare, Logistics, Finance, Education, IT, and Telecommunication. Use glass morphism cards with hover animations. Each card shows the industry icon, name, and a brief benefit description with smooth transitions.","type":"feature","passes":true,"id":2},{"description":"Create an 'Agent Types' section showing Inbound Agents (incoming customer calls) and Outbound Agents (proactive outreach) with visual comparison. Use split-screen glass morphism design with animated icons and feature lists.","type":"feature","passes":true,"id":3},{"description":"Design an interactive 'Live Agent Demo' section with demo tabs for different industries. Include a mock conversation interface with animated message bubbles, showing real-time agent interactions. Add play buttons for video demos and interactive conversation simulator.","type":"feature","passes":true,"id":4},{"description":"Build a 'Capabilities' section with 8-10 unique features of Asklena voice agents: Natural Language Processing, Real-time Analytics, Multi-language Support, Seamless Integration, 24/7 Availability, Custom Training, Security & Compliance, Scalability. Use glass cards with icons and animated counters.","type":"feature","passes":true,"id":5},{"description":"Create a 'Why Choose Asklena' section with 4-5 key differentiators: Advanced AI Technology, Industry Expertise, Proven Results, Dedicated Support. Use glass morphism timeline or comparison layout with smooth animations.","type":"feature","passes":true,"id":6},{"description":"Design an interactive 'Use Cases' carousel showing real-world scenarios: Customer Support Automation, Appointment Scheduling, Lead Qualification, Payment Collection, Survey & Feedback. Use glass cards with smooth scroll and click navigation.","type":"feature","passes":true,"id":7},{"description":"Build a 'Get Started' section with a call-to-action form or quick contact buttons. Include sections for Enterprise Solution, API Documentation, and Schedule a Demo with glass morphism design and smooth interactions.","type":"feature","passes":true,"id":8},{"description":"Create a professional footer with company info, links (About, Features, Pricing, Documentation), social media icons, and contact information. Use glass effect with dark background.","type":"feature","passes":true,"id":9},{"description":"Add custom animations and transitions throughout: smooth glass morphism hover effects, gradient animations, particle effects, animated counters, staggered content reveals, and smooth scroll animations. Ensure dark theme consistency with purple/blue gradients and transparent glass elements.","type":"feature","passes":true,"id":10},{"description":"Replace hero section with a revolutionary 3D holographic-style hero featuring: animated liquid swipe transitions, morphing text effects where letters transform into voice waves, 3D floating geometric shapes that respond to mouse movement, a neural network visualization in the background with animated nodes and connections that pulse with energy. Add a futuristic 'hologram' effect to the main CTA button with lens flare and chromatic aberration.","type":"feature","passes":true,"id":11},{"description":"Create an innovative 'Infinite Loop Industry Showcase' where industry cards move in a continuous circular/orbital motion with parallax depth. As you hover, the card expands with a 3D flip animation showing detailed information. Use glass morphism with rainbow gradient borders that shimmer. Add floating particles around each orbiting card.","type":"feature","passes":true,"id":12},{"description":"Design a 'Neural Network Agent Comparison' visualization showing Inbound vs Outbound agents as animated neural nodes connected by flowing energy lines. When clicked, nodes expand to show capabilities. Use bioluminescent color effects (neon cyan, magenta, purple) with pulsing animations and real-time data flow visualization.","type":"feature","passes":true,"id":13},{"description":"Build an 'Immersive Voice Demo Arena' with a central animated 3D visualization sphere showing real-time agent interactions. Surround it with 6 industry demo pods that float and rotate around the sphere. Each pod has animated voice waveforms, real-time transcription text flowing upward, and a glassmorphic interface. Add 360-degree visual feedback with light rays emanating from the center.","type":"feature","passes":true,"id":14},{"description":"Create a 'Liquid Motion Capabilities Grid' where each capability card has animated liquid backgrounds that flow and morph. Use blob animations with smooth morphing shapes. Each card shows real-time metrics with animated data streams flowing into the card. Add interactive tooltips that appear as floating glass bubbles.","type":"feature","passes":true,"id":15},{"description":"Design an 'Infinite Scroll Timeline' for use cases that auto-rotates and creates a hypnotic effect. Use 3D card stacking with depth perspective. Each card has a holographic scanline overlay effect and animated shimmer. When hovered, cards expand with a parallax depth effect showing detailed information with animated icons.","type":"feature","passes":true,"id":16},{"description":"Build a revolutionary 'Interactive World Map' showing Asklena's global presence with animated connection lines between locations. Use heat map visualization with animated data points. Add a rotating globe visualization with voice agent deployment hotspots highlighted with pulsing indicators.","type":"feature","passes":true,"id":17},{"description":"Create an 'AI Consciousness Meter' - an animated section showing real-time agent performance with animated circular progress rings, flowing data streams, EQ-style audio visualizers, animated gauge meters, and a central neural core that pulses with activity. Use neon colors with glow effects.","type":"feature","passes":true,"id":18},{"description":"Design a 'Morphing Text Generation Wall' where testimonials and stats appear with a typewriter effect mixed with liquid text morphing. Text characters animate in with individual stagger, some letters dissolve and reform. Use gradient text effects with shimmer animations.","type":"feature","passes":true,"id":19},{"description":"Build an advanced 'CTA Transformation Section' where the entire section morphs between different states (Static -> Loading -> Active) with animated transitions. The main button has multiple visual states with SVG animations, particle explosions on click, and a success animation. Add animated background that reacts to button state.","type":"feature","passes":true,"id":20},{"description":"Create a completely new revolutionary hero section. Start fresh - make it a dark, pure black background with a stunning animated 3D floating text effect where 'ASKLENA' rotates and glows. Add animated voice wave visualization in the center using SVG paths that pulse to a beat. Include a glowing CTA button with particle effects on hover. The hero should have floating orb elements that respond to mouse position with parallax effect.","type":"feature","passes":true,"id":21},{"description":"Create an 'Industry Solutions Orbit' section where 6 industry cards float in a circular orbit pattern. Each card should auto-rotate around a center point continuously. On hover, cards should explode outward with a 3D flip animation revealing detailed information on the back. Use glass morphism with rainbow gradient borders that shimmer. Add floating particles orbiting each card.","type":"feature","passes":true,"id":22},{"description":"Build a 'Neural Agent Network' visualization section showing Inbound vs Outbound agents as an interactive network diagram. Draw animated connection lines between nodes using SVG. Use bioluminescent colors (neon cyan, hot pink, purple). Add pulsing node effects and data flow animations along the connections. When hovering over nodes, they expand and show capabilities in a tooltip.","type":"feature","passes":true,"id":23},{"description":"Create an 'Immersive Voice Demo Arena' - a central large 3D sphere showing real-time agent interactions. Surround it with 6 floating demo pods that orbit and rotate around the center sphere. Each pod displays animated voice waveforms, real-time transcription text flowing upward, and a glassmorphic interface. Add 360-degree light rays emanating from the center core.","type":"feature","passes":true,"id":24},{"description":"Build a 'Liquid Blob Capabilities Grid' where each capability card has morphing SVG blob backgrounds that flow and shape-shift. Use animated blob paths that continuously morph between different shapes. Add real-time metrics with animated data streams flowing into each card like water droplets. Include interactive tooltips that appear as floating glass bubbles on hover.","type":"feature","passes":true,"id":25},{"description":"Design a 'Hypnotic 3D Stack Use Cases' section with auto-rotating card stacks. Each card uses 3D perspective transforms to create depth. Add holographic scanline overlay effects. When hovered, cards expand with parallax depth showing detailed use case information. The stack should continuously cycle through automatically.","type":"feature","passes":true,"id":26},{"description":"Create a 'Global Neural Heatmap' showing Asklena's worldwide presence. Build an animated world map with connection lines animating between major cities. Add pulsing heatmap points showing agent deployment density. Include a rotating 3D globe visualization overlaid on the map showing connection points.","type":"feature","passes":true,"id":27},{"description":"Build a 'Real-time Performance Dashboard' with animated metrics visualization. Include circular progress rings that animate on scroll, EQ-style audio visualizers with animated bars, animated gauge meters, and a central pulsing neural core. Use neon cyan and magenta colors with glow effects. Show real-time stats updating.","type":"feature","passes":true,"id":28},{"description":"Design a 'Flowing Data Stream Wall' for testimonials and statistics where text appears with liquid morphing effects. Use SVG filter effects to create text that dissolves and reforms. Add typewriter animation effects mixed with character stagger animations. Use gradient text with shimmer effects.","type":"feature","passes":true,"id":29},{"description":"Create a multi-state 'Mission Control CTA Section' that transforms between different states: (1) Static idle state with breathing animation, (2) Loading state with particle streams and progress animation, (3) Active state with success particles and 'Mission Active' confirmation. The background should react to each state with dynamic animations.","type":"feature","passes":true,"id":30},{"description":"Build a professional footer with company branding, navigation links, social icons, and contact information. Use glass morphism design with subtle animations. Include a newsletter signup form with an email input field and submit button that has hover effects.","type":"feature","passes":true,"id":31},{"description":"Create the ultimate hero section for Asklena. Use actual company tagline: 'Conversations That Sounds Human'. Background should be pure dark with a subtle animated mesh gradient. Feature a large, bold headline with the Asklena value proposition: 'Deploy AI voice agents that handle customer calls, book appointments, and close sales — 24/7, in 40+ languages'. Add a hero stat card showing: '99.9% Uptime', '10K+ Concurrent Calls', '<200ms Response Time'. Include one sleek CTA button 'Start Free Trial'. The hero should have subtle floating animation on text, not heavy particle effects. Use glass morphism for the stat card.","type":"feature","passes":true,"id":32},{"description":"Create an 'Industry Power Grid' - a unique 2x3 responsive grid showcasing the 6 main industries: Healthcare, Logistics, Finance, Education, HR & Recruitment, Ecommerce. Each industry card should have a minimalist icon, industry name, and a hover effect that reveals a brief capability. Use glass morphism with light gradient borders. The grid should load fast without heavy animations. Add a subtle glow effect on hover that doesn't impact performance.","type":"feature","passes":true,"id":33},{"description":"Design a lean 'Real-time Stats Section' showing: '40+ Languages', '147 Active Agents', '2,431 Calls Today', '10M+ Conversations Handled'. Use animated counters that increment on scroll (light animation, not heavy). Display as a 2x2 grid with glass morphism cards. Each stat should have an icon and smooth counter animation.","type":"feature","passes":true,"id":34},{"description":"Build an 'Inbound vs Outbound Comparison' section showing two columns side-by-side. Left: Inbound agents (receive calls) with benefits. Right: Outbound agents (make calls) with benefits. Use split-screen glass morphism design with checkmarks for features. Add smooth subtle hover effects without heavy 3D transforms.","type":"feature","passes":true,"id":35},{"description":"Create a minimalist 'Live Demo Interface' section that showcases a real-time conversation mockup. Show the conversation flow between Customer and Lena with actual dialogue from company website. Use chat-bubble style messages animating in smoothly from left and right. Include an 'Industry Selector' dropdown at the top to switch between Healthcare, Logistics, Finance demos. Keep animations lean - smooth fade-ins, not heavy morphs.","type":"feature","passes":true,"id":36},{"description":"Design a 'Key Features' section with 6 unique differentiators from the company data: 1) Natural Speech (40+ languages), 2) Contextual Intelligence, 3) Lightning Fast (<200ms response), 4) Enterprise Security (SOC 2, GDPR, HIPAA), 5) Omnichannel Ready, 6) Real-time Analysis. Use minimal glass cards with icons and short descriptions. Add simple hover lift effect.","type":"feature","passes":true,"id":37},{"description":"Build an 'Integration Showcase' section displaying the company's integrations: Calendly, Google Calendar, Google Meet, Zoom, Google Drive, Gmail, HubSpot, Twilio, Shopify, Odoo, and API. Show as a masonry grid of company logos with hover effect revealing integration name. Use light animations, not heavy.","type":"feature","passes":true,"id":38},{"description":"Create a 'Use Cases in Action' section with 3 main use cases from company data: 1) Customer Support (2M+ calls), 2) Appointment Scheduling, 3) Sales & Lead Qualification. Each should be a glass morphism card with icon, title, description, and a 'Learn More' link. Add simple smooth hover effects.","type":"feature","passes":true,"id":39},{"description":"Design a 'Security & Trust' section highlighting compliance: 'ISO 27001', 'SOC 2', 'GDPR', 'HITRUST', 'CCPA', 'AICPA SOC', 'PCI DSS'. Display as badge-style cards in a responsive grid. Use subtle animations only. Add a heading explaining the security commitment.","type":"feature","passes":true,"id":40},{"description":"Build a 'Call to Action' section with multiple CTAs: 'Start Free Trial', 'Schedule Demo', 'View Pricing'. Use glass morphism buttons with smooth hover effects. No heavy animations. Include a brief value proposition text.","type":"feature","passes":true,"id":41},{"description":"Create a professional footer with: company name, logo, main navigation links (Solutions, Features, Pricing, Docs), social media icons, copyright info. Use glass morphism design matching the rest of the site. Keep it clean and professional.","type":"feature","passes":true,"id":42},{"description":"Implement smooth, light animations throughout: smooth scroll reveal animations for sections, subtle glow effects on hover, smooth counter increments for stats, light fade-ins for content. Use CSS transitions where possible instead of JavaScript. Optimize bundle size and performance. Ensure 60fps animations with will-change CSS property on animated elements.","type":"feature","passes":true,"id":43},{"description":"Add an innovative 'Voice Stream Visualizer' section that is completely unique and not seen before. This should be a centered animated visualization showing voice data flowing through Asklena's system. Create animated flowing particles/streams that move smoothly from input (left side showing a microphone icon) through a central processor visualization (showing a pulse or wave), to output (right side showing a speaker icon). Use SVG paths with smooth animations. The streams should flow like liquid/particles but be very lean on performance - use CSS animations where possible. Add subtle bioluminescent glow (cyan/purple) but keep it professional. This section should show how voice data moves through the AI system in real-time. Include label: 'Real-time Voice Processing'","type":"feature","passes":true,"id":44}]